trade_exp/src/Catalogs/НастройкиРабочегоФайла/НастройкиРабочегоФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b631388e-ed7f-483e-91a4-43a18432ae68">
  <name>НастройкиРабочегоФайла</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8ed21c86-a4c3-4d59-a379-5daa2cd8faac">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbef8cbb-f855-4f42-8558-ff70c10cf7d3">
    <name>КатегорийныйМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99e8ad37-a754-4cb3-b5ee-c63dc4da9059">
    <name>ТипОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6fe796c-0280-401f-a5bd-016bd2d0dd36">
    <name>ПоказательИнф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f727e00e-d17e-4eb3-82be-674516084fdf">
    <name>ПоказательРасход</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89a46d4c-7cce-420f-b072-f0f3cec6cdf7">
    <name>ИспользоватьТренд</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f85692b-d04a-49a5-8392-71486d883cce">
    <name>ПоказательТренд</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d669b355-72ad-40a2-aa67-e9327052a204">
    <name>ИспользуетсяВРЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3ee7896-3df4-4850-a57f-8e358b0855f4">
    <name>ГрафикЗаявок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81a2094d-ebfa-4eeb-8277-9d3d75935004">
    <name>Подтоварка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8e97785-0c0c-4f85-a915-79e0f08ac25f">
    <name>НеРазделятьЗаказыПоТипуПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="03889449-5244-4f8f-bfda-59bfccd94d0c">
    <name>Поставщики</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="758dd84e-e46a-415f-8f0f-7e2ffe4e5d95">
      <name>ОграничениеВес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="847fa609-b6e3-4e6b-8132-d34b99ea352f">
      <name>СпособОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2cca1726-ee3e-4655-a515-7546b4a0c508">
      <name>Поставщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3f7ae45-16d8-4cef-85aa-93d58c03cffd">
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="716f4cf1-c5ef-4130-9f77-48ac32d5d0ec">
      <name>Договор</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b52a99f-ca72-4a27-8688-5aa72b7cc39c">
      <name>Соглашение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="64a7e923-16d9-4a2a-9bcd-052c3e402ef5">
      <name>ИспользуетсяВРЗ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="880d5c24-3842-4409-8c12-e56b22fe2cdd">
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a62c1cfa-ec78-44c0-86ae-88d065b3cbba">
      <name>ГрафикЗаявок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e83027-d4dd-4a04-bf17-734755482068">
      <name>ОграничениеОбъем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4db1b583-9359-43aa-b59f-978806a28ec1">
      <name>МинимальнаяСумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="408a5052-4a02-461d-a582-8ef2642b90a9">
      <name>НормаЗагрузкиВес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="342492cf-2c6c-4458-9b3f-b2a52038701c">
      <name>НормаЗагрузкиОбъем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="66fb48f2-d14a-4017-9234-9afa5d35a974">
    <name>Оборачиваемость</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0ee40480-ca5b-473b-a943-eb25da9657a8">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59b47d4a-838f-4a10-899d-69fc58625d55">
      <name>СрокОборачиваемости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a97e534a-9460-4b23-8593-97b45b89a1f0">
      <name>СкладИсточник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Enums/ТипыОбеспечения/ТипыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f485e195-bc3b-4230-9780-9a442f5e504c">
  <name>ТипыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="eeb8d2f7-1dd0-4f9d-a1c1-d88188440d05">
    <name>Покупка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3f519e6-910d-4466-a558-85f1888c7c3b">
    <name>Перемещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3094999f-b4ff-434a-9488-c96967e7a128">
    <name>СборкаРазборка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d6be2710-04a8-4559-8255-311e9ed52d22">
    <name>Производство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="56907877-4a71-4f94-83ee-ffebb2c792cf">
    <name>ПроизводствоНаСтороне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/НастройкиРабочегоФайла/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ХранилищеНастроек=Объект.Ссылка.ХранилищеНастроек;
//	СписокНоменклатуры.ДоступныеЗначения.
	ЗаполнитьНастройки();
	УсловноеОформление();  
	Элементы.ГрафикЗаявок.Видимость=Объект.ИспользуетсяВРЗ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	Если ХранилищеНастроек <> Неопределено И ХранилищеНастроек.Получить() <> Неопределено Тогда
		СтруктураНастроек=ХранилищеНастроек.Получить();
		если СтруктураНастроек.Свойство("МассивМенеджеров") тогда
			СписокМенеджеров.ЗагрузитьЗначения(СтруктураНастроек.МассивМенеджеров);
		конецесли;	
		если СтруктураНастроек.Свойство("МассивНоменклатуры") тогда
			СписокНоменклатуры.ЗагрузитьЗначения(СтруктураНастроек.МассивНоменклатуры);
		конецесли;	
		если СтруктураНастроек.Свойство("СкладыОстатков") тогда
			СкладыОстатков.Загрузить(СтруктураНастроек.СкладыОстатков);
		конецесли;	
		
	конецесли;	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СтруктураНастроек=Новый Структура();
	СтруктураНастроек.Вставить("МассивМенеджеров",СписокМенеджеров.ВыгрузитьЗначения());
	СтруктураНастроек.Вставить("МассивНоменклатуры",СписокНоменклатуры.ВыгрузитьЗначения());
	СтруктураНастроек.Вставить("СкладыОстатков",СкладыОстатков.Выгрузить());
	
	ХранилищеНастроек=Новый ХранилищеЗначения(СтруктураНастроек);
	
	Если ХранилищеНастроек <> Неопределено И ХранилищеНастроек.Получить() <> Неопределено Тогда
		ТекущийОбъект.ХранилищеНастроек = ХранилищеНастроек;
	Конецесли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыОстатковСкладыОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Массив = Новый Массив(); 
Массив.Добавить(Тип("СправочникСсылка.Склады")); 
НашеОписание = Новый ОписаниеТипов(Массив);
Элементы.СкладыОстатков.ТекущиеДанные.СкладыДляОстатков.ТипЗначения=НашеОписание;	

КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиГрафикЗаявокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЭлементКоманда = Элементы.Поставщики.ТекущиеДанные;
	РасписаниеКоманды =?(ЭлементКоманда.ГрафикЗаявок="Не заполнено" или ЭлементКоманда.ГрафикЗаявок="" ,Новый РасписаниерегламентногоЗадания,
	СтрокаВРасписание(ЭлементКоманда.ГрафикЗаявокСтрока)); 
	
	Контекст = Новый Структура;
	Контекст.Вставить("ЭлементКоманда", ЭлементКоманда);
	Обработчик = Новый ОписаниеОповещения("ПослеОкончанияРедактированияРасписания", ЭтотОбъект, Контекст);
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеКоманды);
	РедактированиеРасписания.Показать(Обработчик);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияРасписания(Расписание, Контекст) Экспорт 
	если Расписание<>НЕОПРЕДЕЛЕНО тогда
	ЭлементКоманда = Контекст.ЭлементКоманда;
	Если ДополнительныеОтчетыИОбработкиКлиентСервер.РасписаниеЗадано(Расписание) Тогда
		ТекущаяСтрока=Элементы.Поставщики.ТекущиеДанные;
		ТекущаяСтрока.ГрафикЗаявок=Строка(Расписание);
		ТекущаяСтрока.ГрафикЗаявокСтрока=РасписаниеВСтроку(Расписание);
	иначе
		ЭлементКоманда.ГрафикЗаявок= НСтр("ru = 'Не заполнено'");
	конецесли;       
	конецесли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьРасписаниеВСтруктуру(Расписание)
	СтруктураРасписания=ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(Расписание);
	Возврат СтруктураРасписания;
КонецФункции 

&НаСервере
Функция РасписаниеВСтроку(Расписание,Разделитель=",",РазделительМассива=";")
	
	Результат="";
	// массивы
	СтрокаДниНедели="";
	для каждого стр из Расписание.ДниНедели цикл
		СтрокаДниНедели=СтрокаДниНедели+строка(стр)+РазделительМассива;
	конеццикла;	
	
	СтрокаМесяцы="";
	для каждого стр из Расписание.Месяцы цикл
		СтрокаМесяцы=СтрокаМесяцы+строка(стр)+РазделительМассива;
	конеццикла;	
	
	
	Результат=Результат+?(не значениезаполнено(Расписание.ВремяЗавершения),"",Расписание.ВремяЗавершения)+Разделитель+
	?(не значениезаполнено(Расписание.ВремяКонца),"",Расписание.ВремяКонца)+Разделитель+
	Расписание.ВремяНачала+Разделитель+
	Расписание.ДатаКонца+Разделитель+
	Расписание.ДатаНачала+Разделитель+
	Расписание.ВремяКонца+Разделитель+
	Строка(Расписание.ДеньВМесяце)+Разделитель+
	Строка(Расписание.ДеньНеделиВМесяце)+Разделитель+
	Строка(Расписание.ИнтервалЗавершения)+Разделитель+
	Строка(Расписание.ПаузаПовтора)+Разделитель+
	Строка(Расписание.ПериодНедель)+Разделитель+
	Строка(Расписание.ПериодПовтораВтечениеДня)+Разделитель+
	Строка(Расписание.ПериодПовтораДней)+Разделитель+
	СтрокаДниНедели+Разделитель+
	СтрокаМесяцы;
	
	возврат Результат;	
	
КонецФункции // ЗаписатьРасписаниеВСтроку()

&НаСервере
Функция СтрокаВРасписание(строкаРасписания)
	Расписание=Новый РасписаниеРегламентногоЗадания;
	Массив=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(строкаРасписания,",");
	если Массив.Количество()= 0 тогда
		Возврат Расписание;
	конецесли;
	Расписание.ВремяЗавершения=Массив[0];
	Расписание.ВремяКонца=Массив[1];
	Расписание.ВремяНачала= Массив[2];
	Расписание.ДатаКонца= Массив[3];
	Расписание.ДатаНачала= Массив[4];
	Расписание.ВремяКонца= Массив[5];
	Расписание.ДеньВМесяце= Массив[6];
	Расписание.ДеньНеделиВМесяце=Массив[7];
	Расписание.ИнтервалЗавершения= Массив[8];
	Расписание.ПаузаПовтора= Массив[9];
	Расписание.ПериодНедель= Массив[10];
	Расписание.ПериодПовтораВтечениеДня=Массив[11];
	Расписание.ПериодПовтораДней=Массив[12];
	МассивДниНедели=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Массив[13],";",истина);
	для каждого стр из МассивДниНедели цикл
		стр=число(стр);
	конеццикла;	
	Расписание.ДниНедели=МассивДниНедели;
	МассивМесяцы=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Массив[14],";",истина);
	для каждого стр из МассивМесяцы цикл
		стр=число(стр);
	конеццикла;	
	Расписание.Месяцы=МассивМесяцы;
	
	Возврат Расписание;
КонецФункции // СтрокаВРасписание()

&НаСервере
Процедура УсловноеОформление()

	Элементы.ПоставщикиПоставщик.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.ПоставщикиКонтрагент.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.ПоставщикиДоговор.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.ПоставщикиСоглашение.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Покупка;
	Элементы.Подтоварка.Видимость=Объект.ТипОбеспечения=Перечисления.ТипыОбеспечения.Перемещение;

	// для подтоварки
	Элементы.ГруппаРЗ.Видимость=не Объект.Подтоварка;
	Элементы.КатегорийныйМенеджер.Видимость=не Объект.Подтоварка;
	Элементы.СписокМенеджеров.Видимость=не Объект.Подтоварка;
	Элементы.Показатель.Видимость=не Объект.Подтоварка;
	Элементы.ПоказательИнф.Видимость=не Объект.Подтоварка;
	Элементы.ПоказательРасход.Видимость=не Объект.Подтоварка;
	Элементы.СписокНоменклатуры.Видимость=не Объект.Подтоварка;
	Элементы.СкладыОстатковСкладыОстатков.Видимость=не Объект.Подтоварка;
	Элементы.СкладыОстатковПредельнаяДлинаПродаж.Видимость=не Объект.Подтоварка;
	Элементы.СкладыОстатковСпособыОбеспечения.Видимость=Объект.Подтоварка;
	Элементы.Оборачиваемость.Видимость=не Объект.Подтоварка;
	Элементы.Поставщики.Видимость=не Объект.Подтоварка;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбеспеченияПриИзменении(Элемент)  
	Объект.Подтоварка=?(объект.типОбеспечения<>предопределенноезначение("Перечисление.ТипыОбеспечения.Перемещение"),ложь,Объект.Подтоварка);
	УсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяВРЗПриИзменении(Элемент)
	Элементы.ГрафикЗаявок.Видимость=Объект.ИспользуетсяВРЗ;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗаявокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РасписаниеКоманды =?(Элементы.ГрафикЗаявок="Не заполнено" или Элементы.ГрафикЗаявок="" ,Новый РасписаниерегламентногоЗадания,
	СтрокаВРасписание(Объект.ГрафикЗаявокСтрока)); 
	ЭлементКоманда = Элементы;
	Контекст = Новый Структура;
	Контекст.Вставить("ЭлементКоманда", ЭлементКоманда);
	Обработчик = Новый ОписаниеОповещения("ПослеОкончанияРедактированияГрафика", ЭтотОбъект, Контекст);
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеКоманды);
	РедактированиеРасписания.Показать(Обработчик);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияГрафика(Расписание, Контекст) Экспорт 
	если Расписание<>НЕОПРЕДЕЛЕНО тогда   
		если Объект.ГрафикЗаявок<>Строка(Расписание)	тогда
			Объект.ДатаВыполненияРЗ="";
		конецесли;
		ЭлементКоманда = Контекст.ЭлементКоманда;
		Если ДополнительныеОтчетыИОбработкиКлиентСервер.РасписаниеЗадано(Расписание) Тогда
			Объект.ГрафикЗаявок=Строка(Расписание);
			Объект.ГрафикЗаявокСтрока=РасписаниеВСтроку(Расписание);
		иначе
			Объект.ГрафикЗаявок= НСтр("ru = 'Не заполнено'");
		конецесли;       
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура СкладыОстатковСпособыОбеспеченияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Массив = Новый Массив(); 
Массив.Добавить(Тип("СправочникСсылка.СпособыОбеспеченияПотребностей")); 
НашеОписание = Новый ОписаниеТипов(Массив);
Элементы.СкладыОстатков.ТекущиеДанные.СпособыОбеспечения.ТипЗначения=НашеОписание;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтоваркаПриИзменении(Элемент)
	УсловноеОформление();
КонецПроцедуры
